vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA275_DFP.pdsc
    <condition id='allOf.driver.mcx_spc, device=MCXA275.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_spc'/>
      <require condition='device.MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.cmsis_gpio.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.GPIO, device.RTE, driver.gpio, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.GPIO, device.RTE, driver.gpio, device_id=MCXA275.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='GPIO' Capiversion='2.3.0'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
      <require condition='device_id.MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.cmsis_lpi2c.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MCXA275, device.RTE, device_id=MCXA275, driver.lpi2c_edma.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MCXA275, device.RTE, device_id=MCXA275, driver.lpi2c_edma.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='I2C' Capiversion='2.4.0'/>
      <require condition='anyOf.allOf=driver.lpi2c, device_id=MCXA275.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require condition='device_id.MCXA275.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_edma'/>
    </condition>
    <condition id='anyOf.allOf=driver.lpi2c, device_id=MCXA275.internal_condition'>
      <accept condition='allOf.driver.lpi2c, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpi2c, device_id=MCXA275.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
      <require condition='device_id.MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.cmsis_lpspi.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MCXA275, device.RTE, device_id=MCXA275, driver.lpspi_edma.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MCXA275, device.RTE, device_id=MCXA275, driver.lpspi_edma.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='SPI' Capiversion='2.3.0'/>
      <require condition='anyOf.allOf=driver.lpspi, device_id=MCXA275.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require condition='device_id.MCXA275.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi_edma'/>
    </condition>
    <condition id='anyOf.allOf=driver.lpspi, device_id=MCXA275.internal_condition'>
      <accept condition='allOf.driver.lpspi, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpspi, device_id=MCXA275.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
      <require condition='device_id.MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.cmsis_lpuart.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MCXA275, device.RTE, device_id=MCXA275, driver.lpuart_edma.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MCXA275, device.RTE, device_id=MCXA275, driver.lpuart_edma.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='USART' Capiversion='2.4.0'/>
      <require condition='anyOf.allOf=driver.lpuart, device_id=MCXA275.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require condition='device_id.MCXA275.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart_edma'/>
    </condition>
    <condition id='anyOf.allOf=driver.lpuart, device_id=MCXA275.internal_condition'>
      <accept condition='allOf.driver.lpuart, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpuart, device_id=MCXA275.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart'/>
      <require condition='device_id.MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.common.condition_id'>
      <require condition='allOf.device=MCXA275.internal_condition'/>
    </condition>
    <condition id='allOf.cores=cm33.condition_id'>
      <require condition='cores.cm33.internal_condition'/>
    </condition>
    <condition id='cores.cm33.internal_condition'>
      <accept Dcore='Cortex-M33'/>
    </condition>
    <condition id='driver.crc.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.ctimer.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.dac_1.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.dbi.condition_id'>
      <require condition='allOf.driver.video-common, device=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.dbi_flexio_edma.condition_id'>
      <require condition='allOf.driver.edma4, device=MCXA275.internal_condition'/>
    </condition>
    <condition id='allOf.driver.edma4, device=MCXA275.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='edma'/>
      <require condition='device.MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.dc-fb-common.condition_id'>
      <require condition='allOf.driver.video-common, device=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.dc-fb-dbi.condition_id'>
      <require condition='allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MCXA275.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MCXA275.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dbi'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dc-fb-common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='display-common'/>
      <require condition='device.MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.dc-fb-ssd1963.condition_id'>
      <require condition='allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=MCXA275.internal_condition'/>
    </condition>
