vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA275_DFP.pdsc
    <condition id='allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=MCXA275.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dc-fb-common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='display-common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='ssd1963'/>
      <require condition='device.MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.display-adv7535.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MCXA275.internal_condition'/>
    </condition>
    <condition id='allOf.driver.display-common, driver.video-i2c, device=MCXA275.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='display-common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='video-i2c'/>
      <require condition='device.MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.display-common.condition_id'>
      <require condition='allOf.driver.video-common, device=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.display-it6161.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.display-it6263.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.display-sn65dsi83.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.edma4.condition_id'>
      <require condition='allOf.driver.edma_soc, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='allOf.driver.edma_soc, device_id=MCXA275.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='edma_soc'/>
      <require condition='device_id.MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.edma_soc.condition_id'>
      <require condition='allOf.device=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.eim.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.ektf2k.condition_id'>
      <require condition='allOf.device=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.eqdc.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.erm.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.flexcan.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.flexcan_edma.condition_id'>
      <require condition='allOf.driver.edma4, device=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.flexio.condition_id'>
      <require condition='allOf.driver.common, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.flexio_i2c_master.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='allOf.driver.flexio, device_id=MCXA275.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio'/>
      <require condition='device_id.MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.flexio_mculcd.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.flexio_mculcd_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma4, driver.flexio_mculcd, device=MCXA275.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma4, driver.flexio_mculcd, device=MCXA275.internal_condition'>
      <require condition='anyOf.driver.edma4.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_mculcd'/>
      <require condition='device.MCXA275.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.edma4.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='edma'/>
    </condition>
    <condition id='driver.flexio_spi.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.flexio_spi_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma4, driver.flexio_spi, device=MCXA275.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma4, driver.flexio_spi, device=MCXA275.internal_condition'>
      <require condition='anyOf.driver.edma4.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_spi'/>
      <require condition='device.MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.flexio_uart.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.flexio_uart_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma4, driver.flexio_uart, device=MCXA275.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma4, driver.flexio_uart, device=MCXA275.internal_condition'>
      <require condition='anyOf.driver.edma4.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_uart'/>
      <require condition='device.MCXA275.internal_condition'/>
    </condition>
    <condition id='driver.ft3267.condition_id'>
      <require condition='allOf.device=MCXA275.internal_condition'/>
    </condition>
