vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA275_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mau' Cversion='2.0.0' condition='driver.mau.condition_id'>
      <description>MAU Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_mau.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA275/drivers/fsl_mau.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='max30101' Cversion='1.0.0' condition='driver.max30101.condition_id'>
      <description>Driver max30101</description>
      <files>
        <file category='header' name='components/sensor/max30101/fsl_max.h' projectpath='heartrate'/>
        <file category='sourceC' name='components/sensor/max30101/fsl_max.c' projectpath='heartrate'/>
        <file category='include' name='components/sensor/max30101/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_cmc' Cversion='2.2.3' condition='driver.mcx_cmc.condition_id'>
      <description>MCX_CMC Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_cmc.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA275/drivers/fsl_cmc.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_spc' Cversion='2.7.0' condition='driver.mcx_spc.condition_id'>
      <description>MCX SPC Driver</description>
      <files>
        <file category='header' name='devices/MCXA275/drivers/fsl_spc.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_spc.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mcx_vbat' Cversion='2.3.1' condition='driver.mcx_vbat.condition_id'>
      <description>MCX VBAT Driver</description>
      <files>
        <file category='header' name='devices/MCXA275/drivers/fsl_vbat.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_vbat.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mma8451q' Cversion='1.0.0' condition='driver.mma8451q.condition_id'>
      <description>Driver mma8451q</description>
      <files>
        <file category='header' name='components/sensor/mma8451q/fsl_mma.h' projectpath='accel'/>
        <file category='sourceC' name='components/sensor/mma8451q/fsl_mma.c' projectpath='accel'/>
        <file category='include' name='components/sensor/mma8451q/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mma8652fc' Cversion='1.0.0' condition='driver.mma8652fc.condition_id'>
      <description>Driver mma8652fc</description>
      <files>
        <file category='header' name='components/sensor/mma8652fc/fsl_mma.h' projectpath='accel'/>
        <file category='sourceC' name='components/sensor/mma8652fc/fsl_mma.c' projectpath='accel'/>
        <file category='include' name='components/sensor/mma8652fc/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='opamp' Cversion='2.0.0' condition='driver.opamp_fast.condition_id'>
      <description>OPAMP Driver</description>
      <files>
        <file category='header' name='devices/MCXA275/drivers/fsl_opamp.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_opamp.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ostimer' Cversion='2.2.2' condition='driver.ostimer.condition_id'>
      <description>OSTimer Driver</description>
      <files>
        <file category='header' name='devices/MCXA275/drivers/fsl_ostimer.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_ostimer.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='p3t1755' Cversion='2.0.0' condition='driver.p3t1755.condition_id'>
      <description>Driver p3t1755</description>
      <files>
        <file category='header' name='components/sensor/p3t1755/fsl_p3t1755.h' projectpath='component/p3t1755'/>
        <file category='sourceC' name='components/sensor/p3t1755/fsl_p3t1755.c' projectpath='component/p3t1755'/>
        <file category='include' name='components/sensor/p3t1755/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='port' Cversion='2.5.1' condition='driver.port.condition_id'>
      <description>PORT Driver</description>
      <files>
        <file category='header' name='devices/MCXA275/drivers/fsl_port.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='psp27801' Cversion='1.0.0' condition='driver.psp27801.condition_id'>
      <description>Driver psp27801</description>
      <files>
        <file category='header' name='components/display/psp27801/fsl_psp27801.h' projectpath='oled'/>
        <file category='sourceC' name='components/display/psp27801/fsl_psp27801.c' projectpath='oled'/>
        <file category='include' name='components/display/psp27801/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='pwm' Cversion='2.9.0' condition='driver.pwm.condition_id'>
      <description>PWM Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_pwm.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA275/drivers/fsl_pwm.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='reset' Cversion='2.4.0' condition='driver.reset.condition_id'>
      <description>Reset Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_reset.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA275/drivers/fsl_reset.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='romapi' Cversion='2.0.1' condition='driver.romapi.condition_id'>
      <description>ROMAPI Driver</description>
      <files>
        <file category='header' name='devices/MCXA275/drivers/fsl_romapi.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='rtc' Cversion='2.3.0' condition='driver.rtc.condition_id'>
      <description>RTC Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_rtc.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA275/drivers/fsl_rtc.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ssd1963' Cversion='1.2.0' condition='driver.ssd1963.condition_id'>
      <description>Driver ssd1963</description>
      <files>
        <file category='header' name='components/display/ssd1963/fsl_ssd1963.h' projectpath='lcdc'/>
        <file category='sourceC' name='components/display/ssd1963/fsl_ssd1963.c' projectpath='lcdc'/>
        <file category='include' name='components/display/ssd1963/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='st7796s' Cversion='1.0.0' condition='driver.st7796s.condition_id'>
      <description>Driver st7796s</description>
      <files>
        <file category='header' name='components/display/st7796s/fsl_st7796s.h' projectpath='lcdc'/>
        <file category='sourceC' name='components/display/st7796s/fsl_st7796s.c' projectpath='lcdc'/>
        <file category='include' name='components/display/st7796s/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tdet' Cversion='2.2.0' condition='driver.tdet.condition_id'>
      <description>TDET Driver</description>
      <files>
        <file category='header' name='devices/MCXA275/drivers/fsl_tdet.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_tdet.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tma525b' Cversion='1.0.0' condition='driver.tma525b.condition_id'>
      <description>Driver tma525b</description>
      <files>
        <file category='header' name='components/touch/tma525b/fsl_tma525b.h' projectpath='touchpanel'/>
        <file category='sourceC' name='components/touch/tma525b/fsl_tma525b.c' projectpath='touchpanel'/>
        <file category='include' name='components/touch/tma525b/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='trdc' Cversion='2.2.1' condition='driver.trdc_1.condition_id'>
      <description>TRDC Driver</description>
      <files>
        <file category='header' name='devices/MCXA275/drivers/fsl_trdc.h' projectpath='drivers'/>
        <file category='header' name='devices/MCXA275/drivers/fsl_trdc_core.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_trdc.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='trdc_soc' Cversion='2.0.0' condition='driver.trdc_soc.condition_id'>
      <description>TRDC SOC Driver</description>
      <files>
        <file category='header' name='devices/MCXA275/drivers/fsl_trdc_soc.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='tsl2561' Cversion='1.0.0' condition='driver.tsl2561.condition_id'>
      <description>Driver tsl2561</description>
      <files>
        <file category='header' name='components/sensor/tsl2561/fsl_tsl2561.h' projectpath='tsl'/>
        <file category='sourceC' name='components/sensor/tsl2561/fsl_tsl2561.c' projectpath='tsl'/>
        <file category='include' name='components/sensor/tsl2561/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='utick' Cversion='2.0.5' condition='driver.utick.condition_id'>
      <description>UTICK Driver</description>
      <files>
        <file category='header' name='devices/MCXA275/drivers/fsl_utick.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_utick.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='video-common' Cversion='1.1.0' condition='driver.video-common.condition_id'>
      <description>Driver video-common</description>
      <files>
        <file category='header' name='components/video/fsl_video_common.h' projectpath='video'/>
        <file category='sourceC' name='components/video/fsl_video_common.c' projectpath='video'/>
        <file category='include' name='components/video/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='video-i2c' Cversion='1.0.1' condition='driver.video-i2c.condition_id'>
      <description>Driver video-i2c</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category='header' name='components/video/i2c/fsl_video_i2c.h' projectpath='video'/>
        <file category='sourceC' name='components/video/i2c/fsl_video_i2c.c' projectpath='video'/>
        <file category='include' name='components/video/i2c/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='waketimer' Cversion='2.0.1' condition='driver.waketimer.condition_id'>
      <description>WAKETIMER Driver</description>
      <files>
        <file category='header' name='devices/MCXA275/drivers/fsl_waketimer.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_waketimer.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wuu' Cversion='2.4.0' condition='driver.wuu.condition_id'>
      <description>WUU Driver</description>
      <files>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_wuu.c' projectpath='drivers'/>
        <file category='header' name='devices/MCXA275/drivers/fsl_wuu.h' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wwdt' Cversion='2.1.9' condition='driver.wwdt.condition_id'>
      <description>WWDT Driver</description>
      <files>
        <file category='header' name='devices/MCXA275/drivers/fsl_wwdt.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MCXA275/drivers/fsl_wwdt.c' projectpath='drivers'/>
        <file category='include' name='devices/MCXA275/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='misc_utilities' Cversion='1.1.1' condition='utilities.misc_utilities.condition_id'>
      <description>
        Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.
      </description>
      <files>
        <file condition='allOf.toolchains=armgcc.condition_id' category='sourceC' name='devices/MCXA275/utilities/fsl_syscall_stub.c' projectpath='utilities'/>
        <file condition='allOf.toolchains=armgcc.condition_id' category='sourceC' name='devices/MCXA275/utilities/fsl_sbrk.c' projectpath='utilities'/>
        <file condition='allOf.toolchains=armgcc, mdk, cores=cm33.condition_id' category='sourceAsm' name='devices/MCXA275/utilities/fsl_memcpy.S' projectpath='utilities'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='assert' Cversion='1.0.0' condition='utility.assert.condition_id'>
      <description>Utility assert</description>
      <files>
        <file category='header' name='devices/MCXA275/utilities/fsl_assert.h' projectpath='utilities'/>
        <file category='sourceC' name='devices/MCXA275/utilities/fsl_assert.c' projectpath='utilities'/>
        <file category='include' name='devices/MCXA275/utilities/'/>
      </files>
    </component>
